app/controllers/candidatos_controller.rb

SELECT  "candidatos".* FROM "candidatos"  LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "candidatos"
---
  def index
    @candidatos = Candidato.all.page params['page']

INSERT INTO "candidatos" ("created_at", "nome", "numero", "partido_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-02 14:06:50.080154"], ["nome", "Lula"], ["numero", 13], ["partido_id", 1], ["updated_at", "2014-09-02 14:06:50.080154"]]
---
  def create
    @candidato = Candidato.new(candidato_params)

    respond_to do |format|
      if @candidato.save

DELETE FROM "candidatos" WHERE "candidatos"."id" = ?  [["id", 980190962]]
---
  def destroy
    @candidato.destroy

SELECT  "candidatos".* FROM "candidatos"  WHERE "candidatos"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_candidato
      @candidato = Candidato.find(params[:id])