app/controllers/eleitors_controller.rb

  def index
    @eleitors = Eleitor.all.page params['page']
---
SELECT  "eleitors".* FROM "eleitors"  LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "eleitors"

  def create
    @eleitor = Eleitor.new(eleitor_params)

    respond_to do |format|
      if @eleitor.save
---
INSERT INTO "eleitors" ("created_at", "email", "endereco", "nome", "telefone", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @eleitor.destroy
---
DELETE FROM "eleitors" WHERE "eleitors"."id" = ?  [["id", 980190962]]

    def set_eleitor
      @eleitor = Eleitor.find(params[:id])
---
SELECT  "eleitors".* FROM "eleitors"  WHERE "eleitors"."id" = ? LIMIT 1  [["id", 980190962]]