app/controllers/partidos_controller.rb

SELECT  "partidos".* FROM "partidos"  LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "partidos"
---
  def index
    @partidos = Partido.all.page params['page']

INSERT INTO "partidos" ("created_at", "nome", "numero", "sigla", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-02 14:06:36.773054"], ["nome", "PT"], ["numero", 13], ["sigla", "PT"], ["updated_at", "2014-09-02 14:06:36.773054"]]
---
  def create
    @partido = Partido.new(partido_params)

    respond_to do |format|
      if @partido.save

DELETE FROM "partidos" WHERE "partidos"."id" = ?  [["id", 980190962]]
---
  def destroy
    @partido.destroy

SELECT  "partidos".* FROM "partidos"  WHERE "partidos"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_partido
      @partido = Partido.find(params[:id])