app/controllers/votos_controller.rb

  def index
    @votos = Voto.all.page params['page']
---
SELECT  "votos".* FROM "votos"  LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "votos"

  def create
    @voto = Voto.new(voto_params)

    respond_to do |format|
      if @voto.save
---
INSERT INTO "votos" ("candidato_id", "created_at", "eleitor_id", "updated_at") VALUES (?, ?, ?, ?)  [["candidato_id", 1], ["created_at", "2014-09-02 14:24:32.594976"], ["eleitor_id", 1], ["updated_at", "2014-09-02 14:24:32.594976"]]

  def destroy
    @voto.destroy
---
DELETE FROM "votos" WHERE "votos"."id" = ?  [["id", 980190962]]

    def set_voto
      @voto = Voto.find(params[:id])
---
SELECT  "votos".* FROM "votos"  WHERE "votos"."id" = ? LIMIT 1  [["id", 980190962]]