app/views/candidatos/_form.html.erb

SELECT "partidos".* FROM "partidos"   ORDER BY "partidos"."numero" ASC
---
    <%= f.label :partido_id %><br>
     <%= f.collection_select(:partido_id ,
    Partido.order(:numero),:id, :sigla) %>